---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.InterferenceFailures.GeometryWarning
source: html/0062e7ac-874a-ee7e-7918-974187af0d66.htm
---
# Autodesk.Revit.DB.BuiltInFailures.InterferenceFailures.GeometryWarning Property

A geometrical error has occurred while checking for Interference. Reported interference may not be accurate.

## Syntax (C#)
```csharp
public static FailureDefinitionId GeometryWarning { get; }
```